Revit 2027 API
UIControlledApplication.SelectionChanged Event
 Subscribe to the SelectionChanged event to be notified after the selection was changed.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<SelectionChangedEventArgs> SelectionChanged
Public Event SelectionChanged As EventHandler(Of SelectionChangedEventArgs)
public:
 event EventHandler<SelectionChangedEventArgs^>^ SelectionChanged {
	void add (EventHandler<SelectionChangedEventArgs^>^ value);
	void remove (EventHandler<SelectionChangedEventArgs^>^ value);
}
member SelectionChanged : IEvent<EventHandler<SelectionChangedEventArgs>,
    SelectionChangedEventArgs>
Value
EventHandler<SelectionChangedEventArgs>
Remarks
This event is raised after the selection was changed in the current document. Handlers of this event are forbidden to make modifications to the current document. Handlers of this event are forbidden to change the selection to the current document. It is not allowed to open a new transaction in the active document when handling this event.
See Also
Reference
UIControlledApplication Class
Autodesk.Revit.UI Namespace